# US - Baby Names

### Introduction:

We are going to use a subset of [US Baby Names](https://www.kaggle.com/kaggle/us-baby-names) from Kaggle.  
In the file it will be names from 2004 until 2014

### Import the dataset from this [address](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv).

### Assign it to a variable called baby_names.

In [27]:
import pandas as pd
baby_names = pd.read_csv("US_Baby_Names_right.csv")
baby_names.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1016395 entries, 0 to 1016394
Data columns (total 7 columns):
 #   Column      Non-Null Count    Dtype
---  ------      --------------    -----
 0   Unnamed: 0  1016395 non-null  int64
 1   Id          1016395 non-null  int64
 2   Name        1016395 non-null  object
 3   Year        1016395 non-null  int64
 4   Gender      1016395 non-null  object
 5   State       1016395 non-null  object
 6   Count       1016395 non-null  int64
dtypes: int64(4), object(3)
memory usage: 54.3+ MB

### See the first 10 entries

In [28]:
baby_names.head(10)

   Unnamed: 0     Id      Name  Year Gender State  Count
0       11349  11350      Emma  2004      F    AK     62
1       11350  11351   Madison  2004      F    AK     48
2       11351  11352    Hannah  2004      F    AK     46
3       11352  11353     Grace  2004      F    AK     44
4       11353  11354     Emily  2004      F    AK     41
5       11354  11355   Abigail  2004      F    AK     37
6       11355  11356    Olivia  2004      F    AK     33
7       11356  11357  Isabella  2004      F    AK     30
8       11357  11358    Alyssa  2004      F    AK     29
9       11358  11359    Sophia  2004      F    AK     28

### Delete the column 'Unnamed: 0' and 'Id'

In [29]:
# Delete Unnamed[0]
del baby_names['Unnamed: 0']

# delete id 

del baby_names['Id']

### Is there more male or female names in the dataset?

In [30]:
baby_names['Gender'].value_counts()

Gender
F    558846
M    457549
Name: count, dtype: int64

### Group the dataset by name and assign to names

In [35]:
# you don't want to sum the Year column, so you delete it
#del baby_names["Year"]

# group the data
names = baby_names.groupby("Name")['Count'].sum().reset_index()

# print the first 5 observations
names.head()

# print the size of the dataset
#print(names.shape)

# sort it from the biggest value to the smallest one
names_sorted = names.sort_values(by='Count', ascending=False).set_index('Name')

# Display the result
print(names_sorted)

             Count
Name
Jacob       242874
Emma        214852
Michael     214405
Ethan       209277
Isabella    204798
...            ...
Eniola           5
Atlantis         5
Marci            5
Simarpreet       5
Nita             5

[17632 rows x 1 columns]

### How many different names exist in the dataset?

In [36]:
# as we have already grouped by the name, all the names are unique already. 
# get the length of names
len(names)

17632

### What is the name with most occurrences?

In [42]:
#names.Count.idxmax()

names[names.Count == names.Count.max()]

       Name   Count
7198  Jacob  242874

### How many different names have the least occurrences?

In [44]:
len(names[names.Count == names.Count.min()])

2578

### What is the median name occurrence?

In [45]:
names[names.Count == names.Count.median()]

          Name  Count
524    Aishani     49
637      Alara     49
986     Alysse     49
1083     Ameir     49
1360     Anely     49
...        ...    ...
15403   Sriram     49
16250  Trinton     49
16622     Vita     49
17119     Yoni     49
17570  Zuleima     49

[66 rows x 2 columns]

### What is the standard deviation of names?

In [48]:
names.Count.std()

11006.06946789057

### Get a summary with the mean, min, max, std and quartiles.

In [49]:
names.describe

<bound method NDFrame.describe of           Name  Count
0        Aaban     12
1        Aadan     23
2      Aadarsh      5
3        Aaden   3426
4       Aadhav      6
...        ...    ...
17627     Zyra     42
17628    Zyrah     11
17629    Zyren      6
17630    Zyria     59
17631   Zyriah     58

[17632 rows x 2 columns]>